{"basics":{"name":"Kirill Goltsman","label":"Software Engineer and Tech Blogger","image":"","email":"goltsmank@gmail.com","phone":"","url":"https://www.linkedin.com/in/kirillgoltsman/","summary":"I am software engineer with over 8 years of experience in web development, blockchain, and AI/ML","location":{"address":"Spain","postalCode":"","city":"Malaga","countryCode":"ES","region":"Malaga"},"profiles":[{"network":"Twitter","username":"kirillgoltsman","url":"https://x.com/kirillgoltsman"}]},"work":[{"name":"Orichal Partners","position":"ML engineer","url":"","startDate":"2022-05-05","endDate":"2024-03-01","summary":"Building and deploying MLL models for the financial industry","highlights":["created data pipelines (ETL) to enable model training and fine-tuning.","developed a robust pipeline to extract blockchain data from Graph nodes using GraphQL queries.","performed statistical analysis on created datasets using various ML and statistical methods including classification,clustering, time series analysis, regression analysis, gradient boosting, etc.","used LLMs (large language models) for downstream tasks such as sentiment analysis, summarization, and named entity recognition.","fine-tuned language models with in-house data for the use in automatic question-answering applications and chatbots"]},{"name":"Orichal Partners","position":"Senior Software Engineer","url":"","startDate":"2020-07-04","endDate":"2022-05-01","summary":"Building Solidity smart contracts for the financial industry","highlights":["Built core contracts for the DeFi risk tranching product including tranching, staking, oracle integration, voting escrow, etc","Developed and deployed subgraphs using the Graph protocol to index contract data and  make it available to frontend applications.","Managed contract deployments, operations, and upgrades on the Binance Smart Chain mainnet.","Conducted peer review of junior developers' code","Interviewed prospective candidates for the smart developer roles in the company"]},{"name":"Qbox Inc.","position":"Tech Content Manager","url":"","startDate":"2017-04-01","endDate":"2019-11-01","summary":"Building and deploying web applications for the financial industry","highlights":["managing content pipeline (blog creation, editing, scheduling, publishing, social media distribution).","managing a team of content writers (assigning topics, technical and quality review of content, editing","writing documentation for the company's software products.","producing content for Kubernetes training courses","working closely with the marketing team to improve content creation strategies, SEO, trend spotting, social media marketing.","delivering content to the video production team.","writing e-books, blogs and tutorials about Kubernetes, container technologies, and Elasticsearch"]}],"education":[{"institution":"Donetsk National University","location":"Donetsk, Ukraine","url":"","area":"International Relations","studyType":"PhD","startDate":"2002","endDate":"2011","score":"10","courses":["International Relations","Political Science"]},{"institution":"Donetsk National University of Economics and Trade","location":"Donetsk, Ukraine","url":"","area":"Finance","studyType":"Master","startDate":"2008","endDate":"2011","score":"10","courses":["Economics","Finance"]}],"certificates":[{"name":"Machine Learning","date":"2018-01-01","issuer":"Stanford University","url":"","icon":"fa-solid fa-location-dot"}],"publications":[{"name":"Medium Blog","publisher":"","releaseDate":"2018-Present","url":"https://medium.com/@kirill_86245","summary":"My tech blog on Medium. Main topics covered include cloud-native applications, Kubernetes, and Elasticsearch"},{"name":"IOD blog","publisher":"","releaseDate":"2019-Present","url":"https://iamondemand.com/blog/author/kirill-goltsman/","summary":"My tech blog on IOD. Main topics include Artificial Intelligence, MLOps, and cloud-native applications"}],"skills":[{"name":"Software Engineering","level":"Senior","icon":"fa-solid fa-hashtag","keywords":["Languages: Python, JavaScript, Solidity, C++","Databases: SQL, NoSQL, GraphQL, Vector Databases, Elasticsearch","Containerization: Docker, Kubernetes","Version control: Git","Web development: React, Node.js, Express.js"]},{"name":"AI/ML","level":"Master","icon":"fa-solid fa-hashtag","keywords":["DL frameworkers: PyTorch, TensorFlow","MLOps: AWS SageMaker, KubeFlow, MLFlow","AI software ecosystem: Hugging Face libraries( transformers, accelerate, PEFT, diffusers, textgeneration-inference, TRL, optimum)","Data processing: Pandas, NumPy, Scikit-learn","Data visualization: Matplotlib, Seaborn, Plotly"]}],"languages":[{"language":"Russian","fluency":"Native speaker","icon":""},{"language":"English","fluency":"Fluent","icon":""},{"language":"Spanish","fluency":"Basic","icon":""}],"interests":[{"name":"Machine Learning","icon":"fa-solid fa-brain","keywords":["Deep Learning","3d modeling, pose estimation, mesh reconstruction","Speech recognition","Computer Vision"]}],"references":[{"name":"Anthony Wong, Orichal Partners","icon":"fa-solid fa-letter","reference":"I had the pleasure of working closely with Kirill for almost two and a half years on blockchain development. From day one, Kirill stood out with their exceptional skill in coding smart contracts. His technical acumen is truly impressive. Beyond their technical abilities, what really sets Kirill apart is their dedication and professionalism. Despite being on the other side of the globe, he is always punctual to meetings, has a keen eye for detail, ensuring every aspect of a task is thoroughly checked. Their ability to meet deadlines without compromising quality is something I admire greatly. On a personal note, Kirill is a fantastic team player, always willing to lend a hand and share their knowledge. Working with them has been a rewarding experience, and I genuinely look forward to the opportunity to collaborate again in the future."},{"name":"Josephine Hardy, Qbox Inc.","icon":"fa-solid fa-letter","reference":"Anyone who works with Kirill will describe him as intelligent, talented, and hard-working. I have had the pleasure of working with Kirill at Qbox for almost 2 years, and I can honestly say that I have never met anyone who can write as well, or as fast, as Kirill. As Content Director at Qbox, Kirill produced consistently high quality articles and tutorials, eBooks, website copy, and Kubernetes training. He has a gift simplifying confusing technical topics and producing quality content that ranks highly on Google. In fact, he is personally responsible for earning tens of thousands of visits to the Qbox and Supergiant websites, as well as generating high-quality sales leads"}]}